/* ======================================

   No's Archive 認証設定

   【変更する場所】

   毎月ここだけ変更！！

   例：

   archive2026_06
   archive2026_07
   archive2026_08

====================================== */

const PASSWORD =
"Lt0pp0hz";

/* ======================================
   ログイン保持日数
   通常は変更不要
====================================== */

const EXPIRE_DAYS = 30;

/* ======================================
   保存キー
   通常変更不要
====================================== */

const STORAGE_KEY =
"archive_auth";

/* ======================================
   現在時刻
====================================== */

const now = Date.now();

/* ======================================
   保存済み認証情報を取得
====================================== */

const authData =
JSON.parse(
localStorage.getItem(
STORAGE_KEY
)
|| "null");

/* ======================================
   初期状態ではログイン必要
====================================== */

let needLogin = true;

/* ======================================
   保存データがある場合
====================================== */

if(authData){

const age =
now - authData.time;

/* 30日制限 */

const limit =
EXPIRE_DAYS
*24*60*60*1000;

/* ======================================
   条件

   ・30日以内
   ・現在パスと一致

====================================== */

if(
age < limit
&&
authData.password === PASSWORD
){

needLogin = false;

}

}

/* ======================================
   ログイン処理
====================================== */

if(needLogin){

const input =
prompt(
"閲覧パスワードを入力してください"
);

/* パス不一致 */

if(input !== PASSWORD){

location.href =
"index.html";

throw new Error();

}

/* ======================================
   ログイン保存
====================================== */

localStorage.setItem(

STORAGE_KEY,

JSON.stringify({

password:PASSWORD,

time:now

})

);

}